; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	thermograph8 - mode
	infrared0 - mode
	spectrograph4 - mode
	infrared2 - mode
	spectrograph1 - mode
	thermograph5 - mode
	spectrograph3 - mode
	infrared6 - mode
	thermograph7 - mode
	GroundStation3 - direction
	Star2 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph8)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared6)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument2 thermograph5)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph8)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph4)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument8 spectrograph3)
	(supports instrument8 thermograph7)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument9 spectrograph4)
	(supports instrument9 infrared2)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 GroundStation4)
	(have_image Planet5 infrared0)
	(have_image Phenomenon6 spectrograph4)
	(have_image Phenomenon6 spectrograph3)
	(have_image Planet7 infrared0)
	(have_image Planet7 spectrograph1)
	(have_image Planet7 thermograph5)
	(have_image Star8 thermograph7)
	(have_image Planet9 thermograph5)
	(have_image Planet9 infrared6)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 spectrograph4)
))

)

; plan
1. (turn_to satellite3 groundstation4 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 groundstation4)
   goals met: 1 of 13
2. (turn_to satellite2 groundstation0 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation0)
   goals met: 1 of 13
3. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 13
4. (calibrate satellite2 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 1 of 13
5. (turn_to satellite2 planet10 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet10)
   goals met: 1 of 13
6. (take_image satellite2 planet10 instrument6 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 2 of 13
7. (turn_to satellite2 phenomenon6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon6)
   goals met: 2 of 13
8. (turn_to satellite1 star2 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star2)
   goals met: 1 of 13
9. (turn_to satellite0 groundstation3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 13
10. (take_image satellite2 phenomenon6 instrument6 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 2 of 13
11. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 2 of 13
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 13
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 13
14. (calibrate satellite3 instrument8 groundstation4)
   added: (calibrated instrument8)
   goals met: 2 of 13
15. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 2 of 13
16. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 2 of 13
17. (take_image satellite2 phenomenon6 instrument6 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 3 of 13
18. (turn_to satellite0 planet7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet7)
   goals met: 3 of 13
19. (take_image satellite0 planet7 instrument1 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 4 of 13
20. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 4 of 13
21. (take_image satellite0 planet9 instrument1 infrared6)
   added: (have_image planet9 infrared6)
   goals met: 5 of 13
22. (take_image satellite0 planet9 instrument1 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 6 of 13
23. (turn_to satellite0 star1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star1)
   goals met: 7 of 13
24. (turn_to satellite1 planet7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet7)
   goals met: 7 of 13
25. (take_image satellite1 planet7 instrument2 thermograph5)
   added: (have_image planet7 thermograph5)
   goals met: 8 of 13
26. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 8 of 13
27. (take_image satellite1 planet9 instrument2 thermograph5)
   added: (have_image planet9 thermograph5)
   goals met: 9 of 13
28. (turn_to satellite1 groundstation4 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation4)
   goals met: 10 of 13
29. (turn_to satellite2 planet5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet5)
   goals met: 10 of 13
30. (take_image satellite2 planet5 instrument6 infrared0)
   added: (have_image planet5 infrared0)
   goals met: 11 of 13
31. (turn_to satellite2 planet7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet7)
   goals met: 11 of 13
32. (take_image satellite2 planet7 instrument6 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 12 of 13
33. (turn_to satellite3 star8 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star8)
   goals met: 12 of 13
34. (take_image satellite3 star8 instrument8 thermograph7)
   added: (have_image star8 thermograph7)
   goals met: 13 of 13
